//10 исторических событий в виде объектов ,задать свойства: //http://goup32441.narod.ru/files/ogp/002_dni_voin_slav/dni_voin_slavi.htm
//год , название, описание, ссылку на следующее событие,фотку. 
var events={};
events.d1={
    year: 1812, 
    name: 'День Бородинского сражения (8 сентября)', 
    about: 'Бородинское сражение (во французской версии — «сражение на Москве-реке», фр. Bataille de la Moskowa) — крупнейшее сражение Отечественной войны 1812 года между русской и французской армиями. Сражение состоялось (26 августа) 7 сентября 1812 года у села Бородино, расположенного в 125 километрах западнее Москвы. Сражение закончилось неопределенным для обеих сторон результатом. Французские войска под командованием Наполеона не смогли одержать решающую победу над русскими войсками под командованием генерала Михаила Кутузова, достаточную для победы во всей кампании. Последовавшее отступление русской армии после сражения было продиктовано стратегическими соображениями и в конечном итоге привело к поражению Наполеона.', 
    link: "http://www.calend.ru/holidays/0/0/2224/",
    img: "<img src='img/d1.gif'>",
};
events.d2={
    year: 1709, 
    name: 'День победы русской армии в Полтавской битве (10 июля)', 
    about: '(30 апреля) 11 мая 1709 года шведские войска, вторгшиеся на территорию России, начали осаду Полтавы. Ее гарнизон в составе 4200 солдат и 2600 вооруженных горожан под руководством полковника А.С. Келина успешно отбил ряд штурмов. В конце мая к Полтаве подошли главные силы русской армии во главе с Петром. Они расположились на противоположном от Полтавы левом берегу реки Ворсклы. После того, как (27 июня) 8 июля на военном совете Петр I решился на генеральное сражение, в этот же день передовой отряд русских форсировал Ворсклу севернее Полтавы, у деревни Петровка, обеспечив возможность переправы всей армии. В результате Полтавской битвы армия короля Карла XII перестала существовать. Сам король с Мазепой скрылся на территории Османской империи. Решительная победа русских привела к перелому в Северной войне в пользу России и положила конец господству Швеции как главной военной силы в Европе. В 1710 году в Санкт-Петербурге в честь победы в этой битве по указу Петра была построена Сампсониевская церковь (поскольку битва произошла в день святого Сампсония Странноприимца - его память чтят 27 июня по старому стилю). К 25-летнему юбилею битвы в Петергофе была установлена известная сегодня скульптурная группа «Самсон, разрывающий пасть льву», где лев символизировал Швецию, герб которой содержит этого геральдического зверя. На самом поле Полтавской битвы в 1852 году была заложена Сампсониевская церковь. Первое крупное празднование победы в Полтавской битве было организовано к ее 200-летию в 1909 году: учреждена медаль «В память 200-летия Полтавской битвы», на месте битвы основан музей-заповедник «Поле Полтавской битвы» (ныне Национальный музей-заповедник), установлено несколько памятников. В советское время о событии практически забыли, лишь в 1981 году, при подготовке к 275-летию битвы, Полтавское поле объявлено государственным историко-культурным заповедником. А с 1995 года эта дата отмечается как День воинской славы России.', 
    link: 'http://www.calend.ru/holidays/0/0/2223/',
    img: "<img src='img/d2.gif'>",
};
events.d3={
    year: 1770, 
    name: 'День победы русского флота над турецким флотом в Чесменском сражении (7 июля)', 
    about: 'Бой начался в 11 часов 30 минут 5 июля в Хиосском проливе и вошел в историю как Хиосское сражение. «Святой Евстафий» под командованием адмирала Григория Спиридова атаковал флагманский корабль турецкой эскадры «Реал Мустафа». После того как горящая мачта «Реал Мустафы» упала на «Святого Евстафия», взорвался сначала русский флагман, а затем и турецкий. К 14 часам турки уже отступили в Чесменскую бухту — под прикрытие береговых батарей. В течение следующего дня российские корабли обстреливали противника с большого расстояния, а к вечеру несколько кораблей встали на якоря перед входом в бухту и вступили в бой с турецкими судами. В половине второго ночи один из линейных кораблей противника взорвался. Бой продолжался до восьми утра и окончился большими потерями с обеих сторон. Однако победа осталась за русским флотом.', 
    link: 'http://www.calend.ru/holidays/0/0/3084/',
    img: "<img src='img/d3.jpg'>",
};
events.d4={
    year: 1943, 
    name: 'День победы советских войск в Курской битве (23 августа)', 
    about: 'Курская битва явилась решающей в обеспечении коренного перелома в ходе Великой Отечественной войны. Гитлеровское командование планировало провести крупное наступление летом 1943 года, овладеть стратегической инициативой и повернуть ход войны в свою пользу. Для этого была разработана и в апреле 1943 года утверждена военная операция под кодовым названием «Цитадель». Имея сведения о подготовке немецко-фашистских войск к наступлению, Ставка Верховного Главнокомандования приняла решение временно перейти к обороне на Курском выступе и в ходе оборонительного сражения обескровить ударные группировки врага. Тем самым планировалось создать благоприятные условия для перехода советских войск в контрнаступление, а затем в общее стратегическое наступление.', 
    link: 'http://www.calend.ru/holidays/0/0/530/',
    img: "<img src='img/d4.gif'>",
};
events.d5={
    year: 1242, 
    name: 'Ледовое побоище (18 апреля)', 
    about: 'По известиям летописей, Ледовое побоище началось при солнечном восходе у Воронея Камени на Узмени. Традиционная схема битвы выглядит следующим образом. Немецкая конная колонна атаковала пеший центр русского войска, нанесла ему большие потери, однако, была охвачена с флангов княжеской конницей и обратилась в бегство. На льду Чудского озера пало 400 немецких воинов (из них двадцать были настоящие «братья»-рыцари), 90 немцев (из них 6 «братьев») попали к русским в плен. Источники свидетельствуют, что пленные шли возле своих коней во время радостного въезда князя Александра в Псков. Эта битва, вместе с победами князя Александра над шведами (15 июля 1240 года на Неве) и над литовцами (в 1245 году под Торопцем, у озера Жизца и близ Усвята), имела большое значение для Пскова и Новгорода, задержав напор трех серьезных врагов с запада — в то самое время, когда остальная Русь терпела большие потери от княжеских усобиц и последствий татарского завоевания.', 
    link: 'http://www.calend.ru/holidays/0/0/2222/',
    img: "<img src='img/d5.gif'>",
};
events.d6={
    year: 1380, 
    name: 'День победы русских полков в Куликовской битве (21 сентября)', 
    about: 'Битва на Куликовом поле серьезно подорвала военное могущество Золотой Орды и ускорила ее последующий распад. Она способствовала дальнейшему росту и укреплению Руси как единого государства, подняла роль Москвы как центра объединения русских земель. Согласно летописям, битва произошла в день Рождества Пресвятой Богородицы. Князь Дмитрий возлагал большие надежды на помощь Богородицы и вознес ей свои молитвы. В храме Рождественского монастыря города Владимира, где покоилось тело князя Александра Невского, в ночь на Рождество (с 7 на 8 сентября по старому стилю) молились служители, прося Александра оказать помощь Дмитрию. И тут произошло чудо - возле гроба князя зажглись свечи, князь Александр поднялся над гробом, посмотрел на монахов и сделался невидимым. Матерь Божия не отвергла молитв православных христиан и поддержала их дух и силы в нелегком бою. С тех лет Русская Православная Церковь в день Рождества Пресвятой Богородицы празднует и победу над Мамаем.', 
    link: 'http://www.calend.ru/holidays/0/0/543/',
    img: "<img src='img/d6.gif'>",
};
events.d7={
    year: 1790, 
    name: 'День победы русской эскадры у мыса Тендра (11 сентября)', 
    about: 'в результате напряженного боя 7 турецких кораблей сдались, остальные спаслись бегством. Во время сражения турки потеряли свыше 2 тысяч человек, в том числе более 700 пленными. Русский флот, состоявший из 10 линейных кораблей, 6 фрегатов, 1 бомбардирского корабля, 20 вспомогательных судов, около 800 орудий, потерь в кораблях не имел, погибли 21 человек, 25 были ранены. Победа у мыса Тендра в военной кампании 1790 года обеспечила прочное господство русского флота на Черном море. Блестящая победа русского флота также обеспечила прорыв к Измаилу Днепровской флотилии, оказавшей большую помощь сухопутной армии во взятии крепости. А Федора Федоровича Ушакова в России прозвали «морской Суворов».', 
    link: 'http://www.calend.ru/holidays/0/0/542/',
    img: "<img src='img/d7.gif'>",
};
events.d8={
    year: 1714, 
    name: 'День победы русской эскадры у мыса Синоп (1 декабря)', 
    about: 'Эскадра под командованием Нахимова заблокировала в Синопской бухте турецкий флот под командованием Осман-паши. После битвы, длившейся четыре с половиной часа, были уничтожены 15 из 16 турецких кораблей — только одному удалось спастись бегством. Разгром турок был абсолютным: было убито и ранено более трех тысяч османских моряков против 38 убитых и 235 раненых в эскадре Нахимова. Осман-паша, два его командира корабля и 200 матросов попали в русский плен. Блестящая победа русской эскадры в этом сражении стала возможной благодаря не только героизму и боевой подготовке русских моряков и офицеров, но и высокому флотоводческому мастерству адмирала Нахимова, и показала высокий уровень тактики русского флота. И сегодняшний День воинской славы — ещё один повод вспомнить героев далекой войны и обратиться к истории великих сражений русской армии.', 
    link: 'http://www.calend.ru/holidays/0/0/629/',
    img: "<img src='img/d8.gif'>",
};
events.d9={
    year: 1714, 
    name: 'Победа у мыса Гангут (9 августа)', 
    about: 'Шведы только убитыми потеряли 361 человека. На берегу вблизи места сражение были погребены 127 россиян, погибших в сражении в Рилакс-фиорде. В этом сражении Петр сумел создать превосходство в силах на главном направлении, сосредоточив против флагманского судна противника сразу одиннадцать галер, а ударами по флангам исключил из действия часть артиллерии противника. Эреншельд решил, что со стороны русских последует фронтальный удар, но просчитался. Петр переиграл шведского флагмана. Эта победа стала первым крупным военным успехом русского флота и имела большое военно-политическое значение, сам Петр I приравнивал ее по значению к Полтавской битве. Ведь молодой российский флот нанес поражение сильнейшему в то время шведскому флоту, который до Гангутской битвы не знал поражений. К тому же, этот военный успех значительно укрепил позиции русских войск в Финляндии и создал условия для перенесения военных действий на территорию самой Швеции.', 
    link: 'http://www.calend.ru/holidays/0/0/531/',
    img: "<img src='img/d9.jpg'>",
};
events.d10={
    year: 1943, 
    name: 'День победы в Сталинградской битве', 
    about: '200 героических дней обороны Сталинграда вошли в историю, как самые кровопролитные и жестокие. При обороне города погибли и были ранены более семисот тысяч советских солдат и офицеров. Сталинградская битва стала крупнейшей сухопутной битвой в ходе Второй мировой войны и одним из переломных моментов в ходе военных действий, после которых немецкие войска окончательно потеряли стратегическую инициативу.', 
    link: 'http://www.calend.ru/holidays/0/0/1869/',
    img: "<img src='img/d10.jpg'>",
};
var correctAnswer = 0;

var i = 1; 
for(date in events) {
    document.write("Вопрос № " + i + "<br />");
    i++;

    var antwort = prompt("Укажите год, в котором произошло событие: \n" + events[date].name);
    if(antwort == events[date].year)
        correctAnswer ++;

        document.write(events[date].name + "<br />");
        document.write(events[date].year + "<br />");
        document.write(events[date].about + "<br />");
        document.write(events[date].link + "<br />");
        document.write(events[date].img + "<br />" + "<br />");


}

alert("Вы правильно ответили на " + correctAnswer+ "вопрос(ов)");
//Пользователю показывать историческое событие (document.write())
//(document.write())
//задавать вопрос(prompt) о ее дате
//(prompt)
//при получении ответа сверять правильность ответа и 
//выдавать результат проверки (alert) правильно, неправильно.
//alert("Правильно");
//alert("Неправильно");
//Пример вывода:
//document.write("<div class="history"><h2>Куликовская битва</h2>");
//document.write("<img src="image.jpg">);
//document.write("<p>Описание ...</p></div>");
//В конце выводить итоговый подсчет:  правильных ответов 1 из 10
//var correctAnswer = 0;
//alert("Правильных ответов: "+correctAnswer);
